
## Plan Result (ithc)




<pre><code>Plan: 31 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.storage_account_name
  * azurerm_key_vault_secret.storage_account_primary_key
  * azurerm_key_vault_secret.storage_account_secondary_key
  * azurerm_private_endpoint.private_endpoint
  * azurerm_storage_account.storage_account
  * azurerm_storage_container.client_containers[0]
  * azurerm_storage_container.client_containers[1]
  * azurerm_storage_container.client_containers[2]
  * azurerm_storage_container.client_containers[3]
  * azurerm_storage_container.client_containers[4]
  * azurerm_storage_container.client_containers[5]
  * azurerm_storage_container.client_containers[6]
  * azurerm_storage_container.client_containers[7]
  * azurerm_storage_container.client_containers[8]
  * azurerm_storage_container.client_containers[9]
  * azurerm_storage_container.client_containers[10]
  * azurerm_storage_container.client_containers[11]
  * azurerm_storage_container.client_containers[12]
  * azurerm_storage_container.client_rejected_containers[0]
  * azurerm_storage_container.client_rejected_containers[1]
  * azurerm_storage_container.client_rejected_containers[2]
  * azurerm_storage_container.client_rejected_containers[3]
  * azurerm_storage_container.client_rejected_containers[4]
  * azurerm_storage_container.client_rejected_containers[5]
  * azurerm_storage_container.client_rejected_containers[6]
  * azurerm_storage_container.client_rejected_containers[7]
  * azurerm_storage_container.client_rejected_containers[8]
  * azurerm_storage_container.client_rejected_containers[9]
  * azurerm_storage_container.client_rejected_containers[10]
  * azurerm_storage_container.client_rejected_containers[11]
  * azurerm_storage_container.client_rejected_containers[12]
* Update
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.storage_account_name will be created
  + resource "azurerm_key_vault_secret" "storage_account_name" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/reform-scan-ithc/providers/Microsoft.KeyVault/vaults/reform-scan-ithc"
      + name                    = "storage-account-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storage_account_primary_key will be created
  + resource "azurerm_key_vault_secret" "storage_account_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/reform-scan-ithc/providers/Microsoft.KeyVault/vaults/reform-scan-ithc"
      + name                    = "storage-account-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.storage_account_secondary_key will be created
  + resource "azurerm_key_vault_secret" "storage_account_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/reform-scan-ithc/providers/Microsoft.KeyVault/vaults/reform-scan-ithc"
      + name                    = "storage-account-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_private_endpoint.private_endpoint will be created
  + resource "azurerm_private_endpoint" "private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "reformscanithc-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "reform-scan-ithc"
      + subnet_id                = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-ithc/subnets/scan-storage"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "privatelink.blob.core.windows.net"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "reformscanithc-endpoint"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "reformscanithc"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "reform-scan-ithc"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Team Contact"        = "#rbs"
          + "Team Name"           = "Bulk Scan"
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/reform-scan-shared-infra.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "ithc"
          + "managedBy"           = "Bulk Scanning and Printing"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
              + "Logging",
              + "Metrics",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-01",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas",
              + "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/core-infra-ithc/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-ithc/subnets/scan-storage",
            ]
        }
    }

  # azurerm_storage_container.client_containers[0] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bulkscanauto"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[1] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bulkscan"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[2] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "cmc"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[3] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "crime"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[4] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "divorce"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[5] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "nfd"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[6] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "finrem"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[7] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "pcq"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[8] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "probate"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[9] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sscs"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[10] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "publiclaw"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[11] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "privatelaw"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_containers[12] will be created
  + resource "azurerm_storage_container" "client_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "adoption"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[0] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bulkscanauto-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[1] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bulkscan-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[2] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "cmc-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[3] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "crime-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[4] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "divorce-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[5] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "nfd-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[6] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "finrem-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[7] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "pcq-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[8] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "probate-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[9] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "sscs-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[10] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "publiclaw-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[11] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "privatelaw-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # azurerm_storage_container.client_rejected_containers[12] will be created
  + resource "azurerm_storage_container" "client_rejected_containers" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "adoption-rejected"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "reformscanithc"
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/reform-scan-ithc/providers/Microsoft.Resources/deployments/Reform_Scan"
        name                = "Reform_Scan"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

Plan: 31 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":148,"Program":"tfcmt","SHA1":"","Target":"ithc","Vars":{}} -->